// 1)რა განსხვავებაა let, const შორის?
// ორივე block-scoped არის, თუმცა let მონაცემთა ისეთი ტიპია, რომელზედაც გადაწერა შეგვიძლია ანუ ცვლადის მნიშვნელობა შეგვიძლია რომ შევცვალოთ, ხოლო const მუდმივია და ვერ შევცვლით

// 2)რა განსხვავებაა primitive და nonprimitive type-ებს შორის?
// Primitive ტიპები ინახავენ უშუალოდ მნიშვნელობას და ასეთი ტიპების მისამართი არ ვიცით
// ხოლო Non-Primitive ტიპები ინახება reference-ის საშუალებით და მისამართი ვიცით (function, object, array)

// 3)რა განსხვავებაა == და === ოპერატორებს შორის?
// == ადარებს მხოლოდ მნიშვნელობებს, ხოლო === მკაცრი ტოლობაა და ადარებს როგორც მნიშვნელობას, ასევე ტიპს

// 4)რა ტიპის არის null
// პრიმიტიული ტიპია, typeof null შეცდომით ობიექტს აბრუნებს და JavaScript-ის ბაგია, ე.წ. "განზრახ ცარიელი მნიშვნელობაა" 

// 5)რა განსხვავებაა funtion და = () => {} შორის
// arrow funtion-ს hoisting-ის პრობლემა აქვს და საკუთარი this keyword-ი არ გააჩნია

// 6)რას ნიშნავს callback function?
// არის ფუნქცია, რომელიც სხვა ფუნქციას გადაეცემა არგუმენტად და მერე შეგვიძლია რომ რაიმე პირობის დასრულების შემდეგ გამოვიძახოთ

// 7)რა განსხვავებაა map, filter და reduce-ს შორის?
// map() - მასივის ყველა ელემენტს გარდაქმნის და დააბრუნებს ახალ მასივს
// filter() - ფილტრავს, არჩევს მხოლოდ იმ ელემენტებს, რომლებიც აკმაყოფილებენ ჩვენ მიერ მითითებულ პირობას
// reduce() - მასივის ყველა ელემენტს ერთად აერთიანებს და ერთ საბოლოო მნიშვნელობად აბრუნებს

// 8)რა არის Promise?
// Promise არის მიკროტასკი, რომელიც არის მეორე დონე და ჯავასკრიპტის ასინქრონულ ოპერაციებს ჰენდლავს
// მას აქვს რაღაც დრო, რაშიც უნდა შესრულდეს ოპერაცია და ამ ეტაპს Pending ჰქვია
// pending-ის შემდეგ რომელიმე შედეგს მოგვცემს: ან Fulfilled ანუ ოპერაცია წარმატებით შესრულდა ან Rejected ანუ ოპერაცია არასწორად შესრულდა

// 9)რა განსხვავებაა Promise.all, Promise.race და Promise.any-ს შორის?
// Promise.all ელოდება ყველა Promise-ის დასრულება, თუ ერთი მაინც დასრულდება შეცდომით, მთელი ოპერაცია rejected ხდება
// Promise.race() აბრუნებს პირველი დასრულებული Promise-ის შედეგს ან resolveს ან rejectს
// Promise.any() აბრუნებს პირველივე წარმატებით შესრულებულ Promise-ს, თუნდაც სხვები წარუმატებელი იყოს. მხოლოდ მაშინ reject-დება როცა ყველა Promise წარუმატებელი იქნება

// 10)რას ნიშნავს async/await და რატომ ვიყენებთ?
// async - ეწერება ფუნქციას წინ და მიუთითებს რომ ეს ფუნქცია არის ასინქრონული და იგი ყოველთვის აბრუნებს Promise-ს
// await - აჩერებს ფუნქციის შესრულებას მანამ სანამ promise არ დასრულდება
// მისი გამოყენებით ასინქრონული კოდი უფრო მარტივად იკითხება და სინქრონულ კოდს ჰგავს

// 11)რა განსხვავებაა class-სა და object-ს შორის?
// class არის blueprintითივით რომლის მიხედვითაც იქმნებიან ობიექტები, ხოლო object ბლუპრინტის რეალური ვერსია სადაც რეალური მნიშვნელობებია ჩაწერილი

// 12)რას აკეთებს constructor class-ში?
// მას შემდეგ რაც გადავაწვდით პარამეტრებს, ჩავწვდებით this keyword-ით, პარამეტრები ავტომატურად გამოიძახება სხვა ახალი ობიექტის შექმნისას

// 13)რა განსხვავებაა მემორი ჰიპსა და მემორი სტექკს შორის

// 14)რა არის ქოლსტეკი

// 15)რა არის ივენთ ლუპი
