// 1)რა განსხვავებაა let, const შორის?
// 2)რა განსხვავებაა primitive და nonprimitive type-ებს შორის?
// 3)რა განსხვავებაა == და === ოპერატორებს შორის?
// 4)რა ტიპის არის null
// 5)რა განსხვავებაა funtion და = () => {} შორის
// 6)რას ნიშნავს callback function?
// 7)რა განსხვავებაა map, filter და reduce-ს შორის?
// 8)რა არის Promise?
// 9)რა განსხვავებაა Promise.all, Promise.race და Promise.any-ს შორის?
// 10)რას ნიშნავს async/await და რატომ ვიყენებთ?
// 11)რა განსხვავებაა class-სა და object-ს შორის?
// 12)რას აკეთებს constructor class-ში?
//13)რა განსხვავებაა მემორი ჰიპსა და მემორი სტექკს შორის
//14) რა არის ქოლსტეკი
//15) რა არის ივენთ ლუპი
